erpdev.СХК_Расширение/src/Documents/СчетФактураКомиссионеру/СчетФактураКомиссионеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f5661083-8399-4044-a48e-ea7c8c9d4933">
  <name>СчетФактураКомиссионеру</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bd3573ff-21c7-4dd7-8134-2fcc83a2cd7f">
    <name>Исправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e85fa4df-5a45-41c7-b60c-a27f78d929cb">
    <name>СчетФактураОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31072c42-6b44-491c-b6aa-df853e39a721">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30553c99-0f77-4324-a845-49f55b50e82b">
    <name>НомерИсправления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c989895b-ade2-4113-90a9-b701dcc7f43a">
    <name>ДатаВыставления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f51c4650-c7ca-4c63-8e4f-ee43f6421f38">
    <name>ВыставленВЭлектронномВиде</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b0278b2e-41f6-4189-8de6-464fdfb37c39">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89c5e84b-2fe9-47fe-8281-d553d658f357">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c4ff827-5631-4cea-8c08-6c10eaa56f3a">
    <name>Комиссионер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8d90c72-5a2b-432a-ae80-cd0ef33129ae">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="73cf6f18-9ed7-45a5-a36e-d6f59c8dce02">
    <name>КодВидаОперации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3f8be965-7336-4665-aa9c-bf26c8cacfb8">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="02a0e4e8-a61e-4cf9-9d21-bf6042a07347">
    <name>Покупатели</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НомерСчетаФактурыРасширенный</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="a7d2bfe8-5bc2-4dc1-ae5a-d85b7891cb9a">
      <name>КПППокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>9</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7a9c8f59-21b4-44df-a1df-edae94fc71be">
      <name>НомерСчетаФактуры</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a30597e4-1cb4-45e7-835d-88e479a3a32f">
      <name>Покупатель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4ba0f39e-e46d-4fe0-9a23-2de54f90ca2a">
      <name>ИННПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Documents/СчетФактураКомиссионеру/Forms/ФормаСпискаПоОтчетуКомиссионера/Module.bsl
&НаСервере
&ИзменениеИКонтроль("СоздатьСчетаФактурыСервер")
Функция Расш1_СоздатьСчетаФактурыСервер(СчетаФактурыКУдалению)

	Для Каждого ДокументКУдалению Из СчетаФактурыКУдалению Цикл
		ДокументОбъект = ДокументКУдалению.ПолучитьОбъект();
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;

	Результат = Новый Массив;

	ФормироватьСводныеСФ = (ВариантФормированияСчетовФактур = 1);

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ИсторияКППКонтрагентов.Период) КАК Период,
	|	ИсторияКППКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗначенияКПП
	|ИЗ
	|	Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СчетаФактурыКомиссионерамКОформлению КАК Покупатели
	|		ПО ИсторияКППКонтрагентов.Ссылка = Покупатели.Покупатель
	|			И ИсторияКППКонтрагентов.Период <= Покупатели.ДатаСчетаФактуры
	|ГДЕ
	|	Покупатели.ОтчетКомиссионера = &ДокументОснование
	|	И Покупатели.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияКППКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияКППКонтрагентов.КПП КАК КПП,
	|	ИсторияКППКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ИсторическоеЗначениеКПП
	|ИЗ
	|	ЗначенияКПП КАК ЗначенияКПП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагентов
	|		ПО ЗначенияКПП.Ссылка = ИсторияКППКонтрагентов.Ссылка
	|			И ЗначенияКПП.Период = ИсторияКППКонтрагентов.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаФактуры.ОтчетКомиссионера КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА СчетаФактуры.ДатаСчетаФактуры = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СчетаФактуры.ОтчетКомиссионера.Дата
	|		ИНАЧЕ СчетаФактуры.ДатаСчетаФактуры
	|	КОНЕЦ КАК Дата,
	|	СчетаФактуры.Организация КАК Организация,
	|	СчетаФактуры.Комиссионер КАК Комиссионер,
	|	СчетаФактуры.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	СчетаФактуры.Валюта КАК Валюта,
	|	СчетаФактуры.Покупатель КАК Покупатель,
	|	СчетаФактуры.НомерСчетаФактуры КАК НомерСчетаФактуры
	|ПОМЕСТИТЬ СчетаФактурыКОформлению
	|ИЗ
	|	РегистрСведений.СчетаФактурыКомиссионерамКОформлению КАК СчетаФактуры
	|ГДЕ
	|	СчетаФактуры.ОтчетКомиссионера = &ДокументОснование
	|	И СчетаФактуры.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОтчета.СчетФактураВыставленныйКомиссионера КАК СчетФактура,
	|	ТоварыОтчета.ДатаСчетаФактурыКомиссионера КАК ДатаСчетаФактуры,
	|	ТоварыОтчета.СчетФактураВыставленныйКомиссионера.Номер КАК НомерСчетаФактуры,
	|	ТоварыОтчета.СчетФактураВыставленныйКомиссионера.Исправление КАК ЭтоИсправительныйСчетФактура,
	|	ТоварыОтчета.СчетФактураВыставленныйКомиссионера.СчетФактураОснование КАК СчетФактураОснование
	|ПОМЕСТИТЬ СчетаФактурыОтчетаИнтеркампани
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями.Товары КАК ТоварыОтчета
	|ГДЕ
	|	ТоварыОтчета.Ссылка В
	|			(ВЫБРАТЬ
	|				СчетаФактурыКОформлению.ДокументОснование
	|			ИЗ
	|				СчетаФактурыКОформлению)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактур.СчетФактура КАК СчетФактураКомиссионера,
	|	ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураКомиссионеру).Сводный КАК Сводный,
	|	СчетаФактурыОтчетаИнтеркампани.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ОснованияИсправительныхСчетФактур
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаФактурыКОформлению КАК СчетаФактурыКОформлению
	|		ПО ЖурналУчетаСчетовФактур.Организация = СчетаФактурыКОформлению.Комиссионер
	|			И ЖурналУчетаСчетовФактур.Контрагент = СчетаФактурыКОформлению.Организация
	|			И (ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураКомиссионеру)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаФактурыОтчетаИнтеркампани КАК СчетаФактурыОтчетаИнтеркампани
	|		ПО ЖурналУчетаСчетовФактур.СчетФактураВыданныйПокупателю = СчетаФактурыОтчетаИнтеркампани.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаФактурыКОформлению.ДокументОснование КАК ДокументОснование,
	|	СчетаФактурыКОформлению.Дата КАК Дата,
	|	СчетаФактурыКОформлению.Организация КАК Организация,
	|	СчетаФактурыКОформлению.Комиссионер КАК Комиссионер,
	|	СчетаФактурыКОформлению.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	СчетаФактурыКОформлению.Валюта КАК Валюта,
	|	СчетаФактурыКОформлению.Покупатель КАК Покупатель,
	|	СчетаФактурыКОформлению.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	СчетаФактурыОтчетаИнтеркампани.СчетФактура КАК СчетФактураВыданный,
	|	СчетаФактурыОтчетаИнтеркампани.ЭтоИсправительныйСчетФактура КАК ЭтоИсправительныйСчетФактура,
	|	СчетаФактурыОтчетаИнтеркампани.СчетФактураОснование КАК СчетФактураОснование,
	|	ЕСТЬNULL(ОснованияИсправительныхСчетФактур.СчетФактураКомиссионера, НЕОПРЕДЕЛЕНО) КАК СчетФактураКомиссионераОснование,
	|	ОснованияИсправительныхСчетФактур.Сводный КАК СчетФактураКомиссионераОснованиеСводный
	|ПОМЕСТИТЬ ИтоговаяТаблицаКОформлению
	|ИЗ
	|	СчетаФактурыОтчетаИнтеркампани КАК СчетаФактурыОтчетаИнтеркампани
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаФактурыКОформлению КАК СчетаФактурыКОформлению
	|		ПО СчетаФактурыОтчетаИнтеркампани.ДатаСчетаФактуры = СчетаФактурыКОформлению.ДатаСчетаФактуры
	|			И СчетаФактурыОтчетаИнтеркампани.НомерСчетаФактуры = СчетаФактурыКОформлению.НомерСчетаФактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОснованияИсправительныхСчетФактур КАК ОснованияИсправительныхСчетФактур
	|		ПО СчетаФактурыОтчетаИнтеркампани.СчетФактураОснование = ОснованияИсправительныхСчетФактур.СчетФактура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетаФактурыКОформлению.ДокументОснование,
	|	СчетаФактурыКОформлению.Дата,
	|	СчетаФактурыКОформлению.Организация,
	|	СчетаФактурыКОформлению.Комиссионер,
	|	СчетаФактурыКОформлению.ДатаСчетаФактуры,
	|	СчетаФактурыКОформлению.Валюта,
	|	СчетаФактурыКОформлению.Покупатель,
	|	СчетаФактурыКОформлению.НомерСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ
	|ИЗ
	|	СчетаФактурыКОформлению КАК СчетаФактурыКОформлению
	|ГДЕ
	|	СчетаФактурыКОформлению.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаФактурыКОформлению.Покупатель КАК Покупатель,
	|	ЕСТЬNULL(ЕСТЬNULL(ИсторическоеЗначениеКПП.КПП, Контрагенты.КПП), """") КАК КПППокупателя,
	|	ЕСТЬNULL(Контрагенты.ИНН, """") КАК ИННПокупателя,
	|	СчетаФактурыКОформлению.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	СчетаФактурыКОформлению.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(ИтоговаяТаблицаКОформлению.ЭтоИсправительныйСчетФактура, ЛОЖЬ) КАК ЭтоИсправительныйСчетФактура
	|ИЗ
	|	СчетаФактурыКОформлению КАК СчетаФактурыКОформлению
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Ссылка = СчетаФактурыКОформлению.Покупатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсторическоеЗначениеКПП КАК ИсторическоеЗначениеКПП
	|		ПО (ИсторическоеЗначениеКПП.Ссылка = Контрагенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтоговаяТаблицаКОформлению КАК ИтоговаяТаблицаКОформлению
	|		ПО (ИтоговаяТаблицаКОформлению.Покупатель = СчетаФактурыКОформлению.Покупатель)
	|			И (ИтоговаяТаблицаКОформлению.ДатаСчетаФактуры = СчетаФактурыКОформлению.ДатаСчетаФактуры)
	|			И (ИтоговаяТаблицаКОформлению.НомерСчетаФактуры = СчетаФактурыКОформлению.НомерСчетаФактуры)
	|ГДЕ
	|	СчетаФактурыКОформлению.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИтоговаяТаблицаКОформлению.ДокументОснование КАК ДокументОснование,
	|	ИтоговаяТаблицаКОформлению.Дата КАК Дата,
	|	ИтоговаяТаблицаКОформлению.Организация КАК Организация,
	|	ИтоговаяТаблицаКОформлению.Комиссионер КАК Комиссионер,
	|	ИтоговаяТаблицаКОформлению.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ИтоговаяТаблицаКОформлению.Валюта КАК Валюта,
	|	ИтоговаяТаблицаКОформлению.Покупатель КАК Покупатель,
	|	ИтоговаяТаблицаКОформлению.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ИтоговаяТаблицаКОформлению.СчетФактураВыданный КАК СчетФактураВыданный,
	|	ИтоговаяТаблицаКОформлению.ЭтоИсправительныйСчетФактура КАК ЭтоИсправительныйСчетФактура,
	|	ИтоговаяТаблицаКОформлению.СчетФактураОснование КАК СчетФактураОснование,
	|	ИтоговаяТаблицаКОформлению.СчетФактураКомиссионераОснование КАК СчетФактураКомиссионераОснование,
	|	ИтоговаяТаблицаКОформлению.СчетФактураКомиссионераОснованиеСводный КАК СчетФактураКомиссионераОснованиеСводный
	|ИЗ
	|	ИтоговаяТаблицаКОформлению КАК ИтоговаяТаблицаКОформлению
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСчетаФактуры,
	|	ЭтоИсправительныйСчетФактура";

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	ГраницаРезультата = РезультатЗапроса.ВГраница(); 
	Покупатели = РезультатЗапроса[ГраницаРезультата - 1].Выгрузить();
	Покупатели.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
	Покупатели.Индексы.Добавить("Обработано, ДатаСчетаФактуры, Покупатель, НомерСчетаФактуры");

	Выборка = РезультатЗапроса[ГраницаРезультата].Выбрать();
	ДанныеЗаполнения = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса[ГраницаРезультата].Колонки Цикл
		ДанныеЗаполнения.Вставить(Колонка.Имя);
	КонецЦикла;

	ТаблицаНовыхСФ = Новый ТаблицаЗначений;
	ТаблицаНовыхСФ.Колонки.Добавить("СчетФактураКомиссионеру", Новый ОписаниеТипов("ДокументСсылка.СчетФактураКомиссионеру"));
	ТаблицаНовыхСФ.Колонки.Добавить("СчетФактураВыданный",     Новый ОписаниеТипов("ДокументСсылка.СчетФактураВыданный"));

	Пока Выборка.Следующий() Цикл

		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);

		НовыйСчетФактура = Документы.СчетФактураКомиссионеру.СоздатьДокумент();

		Отбор = Новый Структура;
		Отбор.Вставить("Обработано", Ложь);
		Отбор.Вставить("ЭтоИсправительныйСчетФактура");
		Отбор.Вставить("ДатаСчетаФактуры");
		Если НЕ ФормироватьСводныеСФ ИЛИ
			Выборка.ЭтоИсправительныйСчетФактура Тогда
			Отбор.Вставить("Покупатель");
			Отбор.Вставить("НомерСчетаФактуры");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);

		СтрокиПокупатели = Покупатели.НайтиСтроки(Отбор);
		Если СтрокиПокупатели.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		ВыставляемыйСФ = Ложь;
		Для каждого Строка Из СтрокиПокупатели Цикл
			Строка.Обработано = Истина;

			НоваяСтрока = НовыйСчетФактура.Покупатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);

			Если НоваяСтрока.Покупатель <> Справочники.Контрагенты.РозничныйПокупатель ИЛИ НоваяСтрока.НомерСчетаФактуры <> "" Тогда
				ВыставляемыйСФ = Истина;
			КонецЕсли;
		КонецЦикла;

		Если ВыставляемыйСФ Тогда 
			ДанныеЗаполнения.Вставить("ДатаВыставления", ДанныеЗаполнения.Дата);
		КонецЕсли;

		НовыйСчетФактура.Заполнить(ДанныеЗаполнения);

		Если Выборка.ЭтоИсправительныйСчетФактура Тогда

			Если Выборка.СчетФактураКомиссионераОснование = Неопределено Тогда

				ШаблонОшибки = НСтр("ru = 'Нельзя сформировать исправленный счет-фактуру №%1 от %2, пока не сформирован исходный';
				|en = 'It is impossible to generate a corrected tax invoice No.%1 from %2 until the original one is generated'");
				ТекстОшибки = СтрШаблон(ШаблонОшибки, Выборка.НомерСчетаФактуры, Выборка.ДатаСчетаФактуры);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				Продолжить;

			КонецЕсли;

			ПоказатьОшибкуСводнойПартии = Ложь;
			ОснованиеИсправления = Неопределено;

			СтрокаНовойСФ = ТаблицаНовыхСФ.Найти(Выборка.СчетФактураОснование, "СчетФактураВыданный");

			Если СтрокаНовойСФ <> Неопределено Тогда

				ОснованиеИсправления = СтрокаНовойСФ.СчетФактураКомиссионеру;
				ПоказатьОшибкуСводнойПартии = ФормироватьСводныеСФ;

			ИначеЕсли Выборка.СчетФактураКомиссионераОснование <> Неопределено Тогда

				ОснованиеИсправления = Выборка.СчетФактураКомиссионераОснование;
				ПоказатьОшибкуСводнойПартии = Выборка.СчетФактураКомиссионераОснованиеСводный;

			КонецЕсли;

			Если ПоказатьОшибкуСводнойПартии Тогда

				ШаблонОшибки = НСтр("ru = 'Документ %1 является сводным. На основании него нельзя сформировать исправленный счет-фактуру №%2 от %3';
				|en = 'The %1 document is a summary document. It is impossible to generate a corrected tax invoice No.%2 from %3 based on it'");
				ТекстОшибки = СтрШаблон(ШаблонОшибки, ОснованиеИсправления, Выборка.НомерСчетаФактуры, Выборка.ДатаСчетаФактуры);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				Продолжить;

			КонецЕсли;

			НовыйСчетФактура.Исправление = Истина;
			НовыйСчетФактура.СчетФактураОснование = ОснованиеИсправления;

		КонецЕсли;

		Попытка
			НовыйСчетФактура.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстОшибки = НСтр("ru = 'Не удалось записать %Документ%. %ОписаниеОшибки%';
			|en = 'Failed to save %Документ%. %ОписаниеОшибки%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%",       НовыйСчетФактура);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки, , ,);
		КонецПопытки;

		Если Не Выборка.ЭтоИсправительныйСчетФактура Тогда

			СтрокаНовойСФ = ТаблицаНовыхСФ.Добавить();
			СтрокаНовойСФ.СчетФактураКомиссионеру = НовыйСчетФактура.Ссылка;
			СтрокаНовойСФ.СчетФактураВыданный = Выборка.СчетФактураВыданный;

		КонецЕсли;

		Результат.Добавить(НовыйСчетФактура.Ссылка);

	КонецЦикла;

	Возврат Результат;

КонецФункции
